### Assignment 1: DataFrame Creation and Indexing

1. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Set the index to be the first column.
2. Create a Pandas DataFrame with columns 'A', 'B', 'C' and index 'X', 'Y', 'Z'. Fill the DataFrame with random integers and access the element at row 'Y' and column 'B'.

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame(np.random.randint(1, 100, size=(6, 4)),index=['Row1','Row2','Row3','Row4','Row5','Row6'] , columns=['A', 'B', 'C', 'D'])
df

       A   B   C   D
Row1  92  45  67  39
Row2  52  50   1  33
Row3  10   8  16  11
Row4  53  46  57  22
Row5  19  14  57   2
Row6  59   6  95  46

2. Create a Pandas DataFrame with columns 'A', 'B', 'C' and index 'X', 'Y', 'Z'. Fill the DataFrame with random integers and access the element at row 'Y' and column 'B'.

In [5]:
df = pd.DataFrame(np.random.randint(1, 100, size=(3, 3)),index=['X','Y','Z'] , columns=['A', 'B', 'C'])
df

    A   B   C
X  86  31  11
Y  91  37  20
Z  63  46  40

In [13]:
df.iloc[1:2,1:2]

    B
Y  37

In [14]:
df.at['Y', 'B']

37

### Assignment 2: DataFrame Operations

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Add a new column that is the product of the first two columns.
2. Create a Pandas DataFrame with 3 columns and 4 rows filled with random integers. Compute the row-wise and column-wise sum.

In [19]:
#1
df = pd.DataFrame(np.random.randint(1,25, size =(3,5)), index=["One","Two",'Three'] , columns=['col1','col2','col3','col4','col5'])

In [20]:
df

       col1  col2  col3  col4  col5
One      18    21     8     5    18
Two      23    24    16    14     4
Three    22    21    13     6     2

In [22]:
df['Product'] = df['col1'] * df['col2']
df

       col1  col2  col3  col4  col5  Product
One      18    21     8     5    18      378
Two      23    24    16    14     4      552
Three    22    21    13     6     2      462

2. Create a Pandas DataFrame with 3 columns and 4 rows filled with random integers. Compute the row-wise and column-wise sum.

In [23]:
#2
df = pd.DataFrame(np.random.randint(1,25, size =(3,4)), index=["One","Two",'Three'] , columns=['col1','col2','col3','col4'])

In [24]:
df

       col1  col2  col3  col4
One      14    10     5    23
Two       4     4     2     8
Three    10    10    20    11

In [33]:
df.sum(axis = 1) ## Horizontal

One      52
Two      18
Three    51
dtype: int64

In [35]:
df.sum(axis = 0) ## Vertical

col1    28
col2    24
col3    27
col4    42
dtype: int64

### Assignment 3: Data Cleaning

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Introduce some NaN values. Fill the NaN values with the mean of the respective columns.
2. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Introduce some NaN values. Drop the rows with any NaN values.

In [49]:
df = pd.DataFrame(np.random.randint(1, 100, size=(5, 3)), columns=['A', 'B', 'C'])
print("Original DataFrame:")
print(df)

df.iloc[1, 1] = np.nan
df.iloc[3, 1] = np.nan
df.iloc[4, 2] = np.nan
print(df)

Original DataFrame:
    A   B   C
0  76  80  78
1  93  21  94
2  23  96  99
3  18  55  65
4  26  70  79
    A     B     C
0  76  80.0  78.0
1  93   NaN  94.0
2  23  96.0  99.0
3  18   NaN  65.0
4  26  70.0   NaN

In [51]:
df.isnull() ##checking null value

       A      B      C
0  False  False  False
1  False   True  False
2  False  False  False
3  False   True  False
4  False  False   True

In [57]:
df.fillna(df.mean(), inplace=True)
df

    A     B     C
0  76  80.0  78.0
1  93  82.0  94.0
2  23  96.0  99.0
3  18  82.0  65.0
4  26  70.0  84.0

In [56]:
df

    A     B     C
0  76  80.0  78.0
1  93  82.0  94.0
2  23  96.0  99.0
3  18  82.0  65.0
4  26  70.0  84.0

2. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Introduce some NaN values. Drop the rows with any NaN values.

In [58]:
df = pd.DataFrame(np.random.randint(1, 100, size=(6, 4)), columns=['A', 'B', 'C','D'])
print("Original DataFrame:")
print(df)

Original DataFrame:
    A   B   C   D
0  50  99  59  63
1  40  10  72   7
2  10  25  71  38
3  65  80  53  46
4   8  19  17  20
5  27  29  83  12

In [61]:
## Adding NAN value 
df.iloc[1, 1] = np.nan
df.iloc[3, 1] = np.nan
df.iloc[4, 2] = np.nan
df

    A     B     C   D
0  50  99.0  59.0  63
1  40   NaN  72.0   7
2  10  25.0  71.0  38
3  65   NaN  53.0  46
4   8  19.0   NaN  20
5  27  29.0  83.0  12

In [62]:
df.isnull()

       A      B      C      D
0  False  False  False  False
1  False   True  False  False
2  False  False  False  False
3  False   True  False  False
4  False  False   True  False
5  False  False  False  False

In [66]:
df.dropna(inplace=True)
df

    A     B     C   D
0  50  99.0  59.0  63
2  10  25.0  71.0  38
5  27  29.0  83.0  12

### Assignment 4: Data Aggregation

1. Create a Pandas DataFrame with 2 columns: 'Category' and 'Value'. Fill the 'Category' column with random categories ('A', 'B', 'C') and the 'Value' column with random integers. Group the DataFrame by 'Category' and compute the sum and mean of 'Value' for each category.
2. Create a Pandas DataFrame with 3 columns: 'Product', 'Category', and 'Sales'. Fill the DataFrame with random data. Group the DataFrame by 'Category' and compute the total sales for each category.

In [3]:
df = pd.DataFrame({'Category': np.random.choice(['A', 'B', 'C'], size=10), 'Value': np.random.randint(1, 100, size=10)})
print("Original DataFrame:")
print(df)

Original DataFrame:
  Category  Value
0        A     70
1        A     75
2        B     10
3        B     36
4        B     95
5        C     52
6        B     52
7        C     49
8        B     13
9        A     90

In [8]:
df.iloc[0:3,]

  Category  Value
0        B     37
1        A     68
2        A     29

In [6]:
grouped = df.groupby('Category')['Value'].agg(['sum', 'mean','count'])
print(grouped)

          sum   mean  count
Category
A         182  45.50      4
B         187  46.75      4
C         106  53.00      2